RIET/src/InformationRegisters/LocalDistributionSettingsForNonLawsonCompanies/LocalDistributionSettingsForNonLawsonCompanies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>LocalDistributionSettingsForNonLawsonCompanies</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>DefaultLegalEntity</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </resources>
  <resources>
    <name>DefaultCostCenter</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </resources>
  <resources>
    <name>SpecifySegment</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>SpecifyCostCenter</name>
    <type>
      <types>EnumRef.TypesOfCostCenters</types>
    </type>
  </resources>
  <resources>
    <name>SpecifyProductLine</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>SpecifyAgreementForRecharge</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>SpecifyAcquisitionCost</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ManagementAccountantSubscription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>UseCostCenterFromLegalEntityForNON_PO</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ColoursUpdater</name>
      <description>Colours updater</description>
    </items>
    <items>
      <name>ExportRequestsLoader</name>
      <description>Export requests loader</description>
    </items>
  </predefined>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>ShowNamesAndDescriptionsRUS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаПодписи</name>
    <type>
      <types>CatalogRef.ПользователиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>EMail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Borgs</name>
    <attributes>
      <name>Borg</name>
      <type>
        <types>CatalogRef.BORGs</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Catalogs/MOTs/MOTs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>MOTs</name>
  <predefined>
    <items>
      <name>AIR</name>
    </items>
    <items>
      <name>COURIER</name>
    </items>
  </predefined>
  <attributes>
    <name>FromTMSIDsList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>FromTMSIDs</name>
    <attributes>
      <name>FromTMSID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ImportWB</name>
    <attributes>
      <name>WBField</name>
      <type>
        <types>EnumRef.ImportWB</types>
      </type>
    </attributes>
    <attributes>
      <name>Waybill</name>
      <type>
        <types>CatalogRef.Waybills</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/CommonModules/РГСофтСерверПовтИспСеанс/Module.bsl
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
КонецФункции

Функция ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
	
КонецФункции

Функция ПолучитьВыборку(ТипОбъекта, ИмяОбъекта, ВыбираемыеПоля, СтруктураОтборов=Неопределено, ПривилегированныйРежим=Ложь) Экспорт
	
	Возврат РГСофт.ПолучитьВыборку(ТипОбъекта, ИмяОбъекта, ВыбираемыеПоля, СтруктураОтборов, ПривилегированныйРежим);
	
КонецФункции

Функция НайтиСсылку(ТипОбъекта, ИмяОбъекта, ПолеПоиска, ЗначениеПоля) Экспорт
	
	Возврат РГСофт.НайтиСсылку(ТипОбъекта, ИмяОбъекта, ПолеПоиска, ЗначениеПоля);
	
КонецФункции

Функция ПолучитьЗначениеПоУмолчанию(Пользователь, Настройка) Экспорт
	
	Возврат УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, Настройка);
	
КонецФункции

Функция ПолучитьПараметрыПечатиСФНаСервере(Пользователь) Экспорт 
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ВыводитьSIRВСФ", УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ВыводитьSIRВСФ"));
	ПараметрыПечати.Вставить("ВыводитьДанныеОСкважинеВСФ", УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ВыводитьДанныеОСкважинеВСФ"));
	ПараметрыПечати.Вставить("ВыводитьЗаголовокСФ", УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ВыводитьЗаголовокСФ"));
	ПараметрыПечати.Вставить("ВыводитьЗаказНарядВСФ", УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ВыводитьЗаказНарядВСФ"));
	ПараметрыПечати.Вставить("ВыводитьРасчетныйСчетВСФ", УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ВыводитьРасчетныйСчетВСФ"));
	ПараметрыПечати.Вставить("ВыводитьДанныеОДоговореВСФ", УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ВыводитьДанныеОДоговореВСФ"));
	ПараметрыПечати.Вставить("ВыводитьНомерАкта", УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ВыводитьНомерАкта"));
	//добавила Федотова Л., РГ-Софт, 10.08.10 ->
	ПараметрыПечати.Вставить("ВыводитьСкидку", Ложь);
	ПараметрыПечати.Вставить("ПроцентСкидки", 20);
	//<-
	ПараметрыПечати.Вставить("ДоговорВШапке", Ложь);
	Возврат ПараметрыПечати;
	
КонецФункции

Функция ЭтоProductionБаза() Экспорт 
	
	// Определение продакшн база или нет основывается на строке соединения
	
	ИмяПродакшнСервера = "ru0149app35";
	IPПродакшнСервера = "134.32.36.109";
	ПродакшнПорт = "1541";
	ИмяПродакшнБазы = "RIET";
		
	ПодстрокиСоединения = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
									СтрокаСоединенияИнформационнойБазы(), ";");
	ИмяСервера = СтроковыеФункцииКлиентСервер.СократитьДвойныеКавычки(Сред(ПодстрокиСоединения[0], 7));
	ИмяИБ = СтроковыеФункцииКлиентСервер.СократитьДвойныеКавычки(Сред(ПодстрокиСоединения[1], 6));
	
	// Проверяем имя базы
	Если ВРег(ИмяИБ) <> ИмяПродакшнБазы Тогда 
		Возврат Ложь;
	КонецЕсли;

	// Проверяем продашкн порт
	ПозицияДвоеточия = СтрНайти(ИмяСервера, ":");
	Если ПозицияДвоеточия > 0 Тогда 
		Порт = Сред(ИмяСервера, (ПозицияДвоеточия+1));
	Иначе
		Порт = "1541";
	КонецЕсли;
	
	Если СокрЛП(Порт) <> ПродакшнПорт Тогда 
		Возврат Ложь;
	КонецЕсли;

	// Если база прописана на локальном компьютере - проверяем его имя
	Если (Найти(НРег(ИмяСервера), "localhost") > 0 
		ИЛИ СтрНайти(ИмяСервера, "127.0.0.1") > 0)
		И СтрНайти(НРег(ИмяКомпьютера()), ИмяПродакшнСервера) > 0 Тогда 
		Возврат Истина;
	КонецЕсли;
	
	// Проверяем имя сервера
	Если СтрНайти(НРег(ИмяСервера), ИмяПродакшнСервера) = 0 
		И СтрНайти(ИмяСервера, IPПродакшнСервера) = 0 Тогда 
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

// { RGS LFedotova 24.01.2018 22:11:00 - вопрос SLI-0007472
Функция ЭтоProductionБазаLogelco() Экспорт 
	
	// Определение продакшн база или нет основывается на строке соединения
	
	ИмяПродакшнСервера = "ru0149app14";
	IPПродакшнСервера = "134.32.36.23"; 
	ПродакшнПорт = "7541";
	ИмяПродакшнБазы = "SLI";
		
	ПодстрокиСоединения = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
									СтрокаСоединенияИнформационнойБазы(), ";");
	ИмяСервера = СтроковыеФункцииКлиентСервер.СократитьДвойныеКавычки(Сред(ПодстрокиСоединения[0], 7));
	ИмяИБ = СтроковыеФункцииКлиентСервер.СократитьДвойныеКавычки(Сред(ПодстрокиСоединения[1], 6));
	
	// Проверяем имя базы
	Если ВРег(ИмяИБ) <> ИмяПродакшнБазы Тогда 
		Возврат Ложь;
	КонецЕсли;

	// Проверяем продашкн порт
	ПозицияДвоеточия = СтрНайти(ИмяСервера, ":");
	Если ПозицияДвоеточия > 0 Тогда 
		Порт = Сред(ИмяСервера, (ПозицияДвоеточия+1));
	Иначе
		Порт = "1541";
	КонецЕсли;
	
	Если СокрЛП(Порт) <> ПродакшнПорт Тогда 
		Возврат Ложь;
	КонецЕсли;

	// Если база прописана на локальном компьютере - проверяем его имя
	Если (Найти(НРег(ИмяСервера), "localhost") > 0 
		ИЛИ СтрНайти(ИмяСервера, "127.0.0.1") > 0)
		И СтрНайти(НРег(ИмяКомпьютера()), ИмяПродакшнСервера) > 0 Тогда 
		Возврат Истина;
	КонецЕсли;
	
	// Проверяем имя сервера
	Если СтрНайти(НРег(ИмяСервера), ИмяПродакшнСервера) = 0 
		И СтрНайти(ИмяСервера, IPПродакшнСервера) = 0 Тогда 
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;
	
КонецФункции
// } RGS LFedotova 24.01.2018 22:11:32 - вопрос SLI-0007472

// { RGS LFedotova 20.09.2016 16:00:26 - вопрос SLI-0006800
Функция ЭтоLogelco() Экспорт 
	
	ПодстрокиСоединения = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
									СтрокаСоединенияИнформационнойБазы(), ";");
	ИмяИБ = СтроковыеФункцииКлиентСервер.СократитьДвойныеКавычки(Сред(ПодстрокиСоединения[1], 6));
	
	// Проверяем имя базы
	Если ИмяИБ = "SLI" ИЛИ ИмяИБ = "test_Liudmila" ИЛИ ИмяИБ = "test_Logelco" Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
// } RGS LFedotova 20.09.2016 16:01:04 - вопрос SLI-0006800

Функция ЭтоLogelco_test() Экспорт 
	
	ПодстрокиСоединения = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
									СтрокаСоединенияИнформационнойБазы(), ";");
	ИмяИБ = СтроковыеФункцииКлиентСервер.СократитьДвойныеКавычки(Сред(ПодстрокиСоединения[1], 6));
	
	// Проверяем имя базы
	Если ИмяИБ = "test_Liudmila" ИЛИ ИмяИБ = "test_Logelco" ИЛИ ИмяИБ = "RIET_test5" Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЭтоRIET_test() Экспорт 
	
	// Определение продакшн база или нет основывается на строке соединения
	
	ИмяПродакшнСервера = "ru0149app35";
	IPПродакшнСервера = "134.32.36.109";
	ПродакшнПорт = "2041";
	ИмяПродакшнБазы = "RIET_test";
		
	ПодстрокиСоединения = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
									СтрокаСоединенияИнформационнойБазы(), ";");
	ИмяСервера = СтроковыеФункцииКлиентСервер.СократитьДвойныеКавычки(Сред(ПодстрокиСоединения[0], 7));
	ИмяИБ = СтроковыеФункцииКлиентСервер.СократитьДвойныеКавычки(Сред(ПодстрокиСоединения[1], 6));
	
	// Проверяем имя базы
	Если ИмяИБ <> ИмяПродакшнБазы Тогда 
		Возврат Ложь;
	КонецЕсли;

	// Проверяем продашкн порт
	ПозицияДвоеточия = СтрНайти(ИмяСервера, ":");
	Если ПозицияДвоеточия > 0 Тогда 
		Порт = Сред(ИмяСервера, (ПозицияДвоеточия+1));
	Иначе
		Порт = "2041";
	КонецЕсли;
	
	Если СокрЛП(Порт) <> ПродакшнПорт Тогда 
		Возврат Ложь;
	КонецЕсли;

	// Если база прописана на локальном компьютере - проверяем его имя
	Если (Найти(НРег(ИмяСервера), "localhost") > 0 
		ИЛИ СтрНайти(ИмяСервера, "127.0.0.1") > 0)
		И СтрНайти(НРег(ИмяКомпьютера()), ИмяПродакшнСервера) > 0 Тогда 
		Возврат Истина;
	КонецЕсли;
	
	// Проверяем имя сервера
	Если СтрНайти(НРег(ИмяСервера), ИмяПродакшнСервера) = 0 
		И СтрНайти(ИмяСервера, IPПродакшнСервера) = 0 Тогда 
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

Функция ПолучитьАдресБазы() Экспорт
	
	Если ЭтоProductionБаза() Тогда 
		Возврат "http://ru0149app35.dir.slb.com/RIET/#";
	Иначе
		Возврат "http://ru0149app35.dir.slb.com/RIET_test/#";
 	КонецЕсли; 	
	
КонецФункции

Функция ЭтоПользовательШлюмберже(Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РеквизитыПользователя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Пользователь, "Код, CCA");
	
	Возврат УправлениеПользователями.НайтиПользователяБД(СокрЛП(РеквизитыПользователя.Код)) <> Неопределено
		И Не ЗначениеЗаполнено(РеквизитыПользователя.CCA);
	
КонецФункции
	
Функция ПолучитьПараметрСеансаShowNamesAndDescriptionsRUS() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат ПараметрыСеанса.ShowNamesAndDescriptionsRUS;
	
КонецФункции

Функция ПолучитьМассивSpecialists() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);

	РольSpecialist = Метаданные.Роли.LocalDistributionSpecialist_ForNonLawsonCompanies;
	
	МассивAliasSpecialists = Новый Массив;
	МассивПользователейИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого ПользовательИБ Из МассивПользователейИБ Цикл
		
		Если ПользовательИБ.Роли.Содержит(РольSpecialist) Тогда 
			МассивAliasSpecialists.Добавить(ПользовательИБ.Имя);
		КонецЕсли;
		
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивAliasSpecialists", МассивAliasSpecialists);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК User,
		|	ВЫРАЗИТЬ(Пользователи.Код КАК СТРОКА(50)) КАК UserAlias
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Код В(&МассивAliasSpecialists)
		|	И НЕ Пользователи.ЭтоГруппа
		|	И НЕ Пользователи.ПометкаУдаления";
				   
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("User"); 
	
КонецФункции

Функция ПолучитьМассивCompaniesWithSettings() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());	
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	LocalDistributionSettingsForNonLawsonCompaniesСрезПоследних.Company КАК Company
		|ИЗ
		|	РегистрСведений.LocalDistributionSettingsForNonLawsonCompanies.СрезПоследних(&ТекДата, ) КАК LocalDistributionSettingsForNonLawsonCompaniesСрезПоследних";
				   
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Company"); 
	
КонецФункции

Функция ПолучитьМассивOperators() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);

	РольOperator = Метаданные.Роли.LocalDistributionOperator_ForNonLawsonCompanies;
	
	МассивAliasOperators = Новый Массив;
	МассивПользователейИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого ПользовательИБ Из МассивПользователейИБ Цикл
		
		Если ПользовательИБ.Роли.Содержит(РольOperator) Тогда 
			МассивAliasOperators.Добавить(ПользовательИБ.Имя);
		КонецЕсли;
		
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивAliasOperators", МассивAliasOperators);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК User,
		|	ВЫРАЗИТЬ(Пользователи.Код КАК СТРОКА(50)) КАК UserAlias
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Код В(&МассивAliasOperators)
		|	И НЕ Пользователи.ЭтоГруппа
		|	И НЕ Пользователи.ПометкаУдаления";
				   
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("User"); 
	
КонецФункции

Функция ПолучитьМассивВалютДляTripNonLawson() Экспорт 
	
	МассивКодов = Новый Массив();
	МассивКодов.Добавить("643");
	МассивКодов.Добавить("840");
	МассивКодов.Добавить("398");
	МассивКодов.Добавить("944");
	МассивКодов.Добавить("978");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивКодов", МассивКодов);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Валюты.Ссылка КАК Валюта
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	Валюты.Код В(&МассивКодов)";
				   
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Валюта"); 
	
КонецФункции

Функция ПолучитьМассивLocalDistributionMOT() Экспорт
	
	//AIR, TRUCK, RAIL, SEA, CURIER
	МассивMOT = Новый Массив;
	
	МассивMOT.Добавить(Справочники.MOTs.AIR);
	МассивMOT.Добавить(Справочники.MOTs.COURIER);
	МассивMOT.Добавить(Справочники.MOTs.НайтиПоКоду("TRUCK"));
	МассивMOT.Добавить(Справочники.MOTs.НайтиПоКоду("RAIL"));
	МассивMOT.Добавить(Справочники.MOTs.НайтиПоКоду("SEA"));
	
	Возврат МассивMOT;
	
КонецФункции

// { RGS AArsentev S-I-0003275 22.06.2017 11:08:55 
Функция ЭтоDGF(User) Экспорт
	
	ЭтоDGF = Ложь;
	Попытка
		CCA = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(User, "CCA");
		// { RGS ASeryakov S-I-0005001 10.04.2018 12:00:00
		//Если ЗначениеЗаполнено(CCA) И СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(CCA, "Код")) = "DGF" Тогда
		Если ЗначениеЗаполнено(CCA) И (СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(CCA, "Код")) = "DGF"
			ИЛИ СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(CCA, "Код")) = "DHL"
			ИЛИ СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(CCA, "Код")) = "GLB"
			ИЛИ СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(CCA, "Код")) = "FML"
			ИЛИ СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(CCA, "Код")) = "CTCS")
			Тогда
			// } RGS ASeryakov S-I-0005001 10.04.2018 12:00:00
			ЭтоDGF = Истина;
		КонецЕсли;
		Возврат ЭтоDGF;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции // } RGS AArsentev S-I-0003275 22.06.2017 11:08:55 


///////////////////////////////////////////////////////////////////////////
// УДАЛИТЬ

Функция ПолучитьЗначениеРеквизита(Ссылка, ИмяРеквизита) Экспорт
	
	// Устаревшее название для функции ЗначениеРеквизитаОбъекта
	
	Возврат ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
КонецФункции

// { RGS AArsentev S-I-0003275 22.06.2017 11:08:55 
// { RGS ASeryakov S-I-0005001 10.04.2018 12:00:00
//Функция ЭтоDGF(User) Экспорт
Функция ЭтоDGForDHL(User) Экспорт
// } RGS ASeryakov S-I-0005001 10.04.2018 12:00:00
	
	ЭтоDGF = Ложь;
	Попытка
		CCA = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(User, "CCA");
		// { RGS ASeryakov S-I-0005001 10.04.2018 12:00:00
		//Если ЗначениеЗаполнено(CCA) И СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(CCA, "Код")) = "DGF" Тогда
		Если ЗначениеЗаполнено(CCA) И (СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(CCA, "Код")) = "DGF"
			ИЛИ СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(CCA, "Код")) = "DHL"
				// { RGS AArsentev 05.06.2018
				ИЛИ СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(CCA, "Код")) = "GLB"
				ИЛИ СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(CCA, "Код")) = "FML")
				// } RGS AArsentev 05.06.2018
			Тогда
			// { RGS ASeryakov S-I-0005001 10.04.2018 12:00:00
			ЭтоDGF = Истина;	
		КонецЕсли;
		Возврат ЭтоDGF;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции // } RGS AArsentev S-I-0003275 22.06.2017 11:08:55
